In [9]:
import pandas as pd 
data = pd.read_csv(r"C:\Users\Chait\OneDrive\Desktop\ad\NewspaperData.csv")
data.head()

            Newspaper    daily   sunday
0       Baltimore Sun  391.952  488.506
1        Boston Globe  516.981  798.298
2       Boston Herald  355.628  235.084
3  Charlotte Observer  238.555  299.451
4   Chicago Sun Times  537.780  559.093

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Newspaper  34 non-null     object
 1   daily      34 non-null     float64
 2   sunday     34 non-null     float64
dtypes: float64(2), object(1)
memory usage: 948.0+ bytes

In [17]:
data.sample(10)

                      Newspaper     daily    sunday
14                 Miami Herald   444.581   553.479
13            Los Angeles Times  1164.388  1531.527
9              Hartford Courant   231.177   323.084
20           Omaha World Herald   223.748   284.611
29      San Francisco Chronicle   570.364   704.322
25  Providence Journal-Bulletin   197.120   268.060
8           Des Moines Register   206.204   344.522
10            Houston Chronicle   449.755   620.752
32                Tampa Tribune   321.626   408.343
5               Chicago Tribune   733.775  1133.249

In [19]:
data.drop('Newspaper',axis=1).corr()

           daily    sunday
daily   1.000000  0.958154
sunday  0.958154  1.000000